<!DOCTYPE html>
<html class="full" lang="en">

  <head>
  <meta charset="utf-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1">


  <title>Research</title>
  <meta name="description" content="John's website that contains information about current research project SustenAgro
">
  <link rel="shortcut icon" href="/images/favicon.ico" type="image/x-icon" />

  <link rel="stylesheet" href="/css/normalize.css">
  <link rel="stylesheet" href="/css/bootstrap-readable.min.css">
  <link rel="stylesheet" href="/css/style.css">
  <script type="text/javascript" src="/js/jquery-1.11.1.min.js"> </script>
  <script type="text/javascript" src="/js/bootstrap.min.js"> </script>
</head>


  <body>
    <div class="container page">
      <header class="site-header">
  <div class="navbar navbar-default" role="navigation">
      <nav class="site-nav">
        <div class="navbar-header">
          <button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-collapse">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
          </button>
          <a class="navbar-brand" href="/">
            <img src="/images/John-mini.png" alt="logo" />
          </a>
        </div>
        <div class="navbar-collapse collapse">
          <ul class="nav navbar-nav">
            <li><a href="/">Inicio</a></li>
            <li><a href="/research">Pesquisa em andamento</a></li>
            <li><a href="/contact">Contato</a></li>
          </ul>
        </div>
      </nav>
  </div>
</header>

      <div class="container-fluid">
      	<div class="well">
	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	T&iacute;tulo da Pesquisa
	        </h6>
    	</div>
		<div class="panel-body">
		    Tecnologias da Web Sem&acirc;ntica na Gerac&atilde;o de Interfaces Gr&aacute;ficas para Sistemas de Apoio a Decis&atilde;o: Caso SustenAgro.
		</div>
	</div>
	
	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	Tema
	        </h6>
    	</div>
		<div class="panel-body">
		    Geração automática de interfaces gráficas de usuário
		</div>
	</div>

	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	Lacuna/problema
	        </h6>
    	</div>
		<div class="panel-body">
		    <p>Flexibilizar a gera&ccedil;&atilde;o de interfaces gr&aacute;ficas por meio do conhecimento do especialista.</p>
		    <p>Que s&atilde;o &eacute; detalhada pelas seguintes perguntas de pesquisa:</p>
		    <ul>
		    	<li>Como integrar o conhecimento dos especialistas em um sistema de apoio a decis&atilde;o, permitindo a cont&iacute;nua mudan&ccedil;a do modelo do dom&iacute;nio?</li>
		    	<li>Como gerar interfaces gr&aacute;ﬁcas a partir das deﬁni&ccedil;&otilde;es do dom&iacute;nio do conhecimento?
		    	</li>
		    </ul>
		</div>
	</div>

	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	Hip&oacute;teses
	        </h6>
    	</div>
		<div class="panel-body">
		    As tecnologias da web sem&acirc;ntica e uma DSL podem suportar a gera&ccedil;&atilde;o de interfaces gr&aacute;ficas baseadas em conhecimento dos especialistas
		</div>
	</div>

	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	Objetivos
	        </h6>
    	</div>
		<div class="panel-body">
		    <p>Desenvolver um sistema web que permita realizar a avalia&ccedil;&atilde;o da sustentabilidade nos<br />
			sistemas produtivos de cana-de-a&ccedil;&uacute;car no centro-sul do Brasil fazendo uso das tecnolo-<br />
			gias da web sem&acirc;ntica para representar o conhecimento dos especialistas e flexibilizar a<br />
			gera&ccedil;&atilde;o da interface gr&aacute;fica de usu&aacute;rio.</p>

			<p><strong>Objetivos espec&iacute;ficos</strong></p>

			<p>&bull; Desenvolver uma ontologia sobre avalia&ccedil;&atilde;o da sustentabilidade nos sistemas produtivos de cana-de-a&ccedil;&uacute;car que vai ser a base conceitual e tecnol&oacute;gica do sistema SustenAgro.</p>

			<p>&bull; Desenvolver uma ontologia sobre controles visuais de interfaces gr&aacute;ficas que vai suportar a defini&ccedil;&atilde;o dos indicadores do sistema SustenAgro.</p>

			<p>&bull; Desenvolver uma DSL que usar&aacute; a ontologia sobre controles visuais e que flexibilizar&aacute; a defini&ccedil;&atilde;o da interface de usu&aacute;rio por parte dos administradores do sistema.</p>

			<p>&bull; Demonstrar que um sistema de apoio na tomada de decis&otilde;es integrado baseado nas tecnologias da web sem&acirc;ntica, permite a realiza&ccedil;&atilde;o de consultas complexas que requerem conhecimento sem&acirc;ntico, facilitando o processo de an&aacute;lises da informa&ccedil;&atilde;o por parte dos usu&aacute;rios.</p>

			<p>&bull; Definir uma arquitetura para sistemas de avalia&ccedil;&atilde;o baseados em conhecimento de dom&iacute;nios espec&iacute;ficos.</p>
		</div>
	</div>

	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	Justificativa/motiva&ccedil;;&atilde;o
	        </h6>
    	</div>
		<div class="panel-body">
		    <p>O processo de avalia&ccedil;&atilde;o da sustentabilidade da cultura de cana-de-a&ccedil;&uacute;car est&aacute; em continua constru&ccedil;&atilde;o e depende do contexto produtivo da organiza&ccedil;&atilde;o da informa&ccedil;&atilde;o nas tr&ecirc;s dimens&otilde;es de sustentabilidade (Oliveira Cardoso, 2013), consiste em um processo especifico para cada cultura, embora nessas caracter&iacute;sticas o desenvolvimento de um sistema computacional para automatizar o metodo de avalia&ccedil;&atilde;o, por&eacute;m &eacute; necess&aacute;ria uma arquitetura que facilite a comunica&ccedil;&atilde;o entre os especialistas do dom&iacute;nio e os desenvolvedores da ferramenta, neste sentido as ontologias satisfazem este requisito porque separam o conhecimento do dom&iacute;nio da l&oacute;gica da computa&ccedil;&atilde;o, e assim, permitem abordar os desenvolvimentos de uma maneira independente, tanto do software como da representa&ccedil;&atilde;o do conhecimento do dom&iacute;nio, por isso ser&aacute; desenvolvido primeiramente a ontologia SustenAgro para posteriormente desenvolver o sistema propiamente dito.</p>

			<p>O conhecimento sobre sustentabilidade no sistema de produ&ccedil;&atilde;o de cana-de-a&ccedil;&uacute;car ser&aacute; representado por meio de entidades, classes, rela&ccedil;&otilde;es sem&acirc;nticas e axiomas. Ditos elementos v&atilde;o constituir a ontologia que ser&aacute; uma representa&ccedil;&atilde;o formal dos conceitos do dom&iacute;nio, os quais ser&atilde;o integrados em cada uma das funcionalidades do sistema permitindo uma personaliza&ccedil;&atilde;o e vincula&ccedil;&atilde;o da informa&ccedil;&atilde;o para satisfazer os requisitos do<br />
			usu&aacute;rio.</p>

			<p>A ontologia do SustenAgro tamb&eacute;m vai suportar uma DSL que permitir&aacute; a defini&ccedil;&atilde;o por parte dos administradores do sistema os elementos e os aspectos da interface gr&aacute;fica do usu&aacute;rio, para assim fornecer flexibilidade na defini&ccedil;&atilde;o da interface grafica.</p>

			<p>Finalmente outra caracter&iacute;stica que ser&aacute; implementada no sistema SustenAgro &eacute; a recupera&ccedil;&atilde;o da informa&ccedil;&atilde;o com significado sem&acirc;ntico, permitindo que o sistema d&ecirc; respostas &agrave;s consultas complexas de interesse para os especialistas.</p>
		</div>
	</div>

	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	Metodologia de Desenvolvimento
	        </h6>
    	</div>
		<div class="panel-body">
		    <p>Para definir o sistema SustenAgro foi realizado o levantamento de requisitos por meio da metodologia SCRUM, identificando-se os seguintes:</p>

		    <ul>
				<li>Triplestore</li>
				<li>Ontologia de dom&iacute;nio</li>
				<li>Ontologia de interface gr&aacute;fica</li>
				<li>Domain Specific Language (DSL)</li>
				<li>Sistema gerador de interfaces gr&aacute;ficas</li>
			</ul>

		</div>
	</div>

	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	Resumo com Estrutura&ccedil;&atilde;o Expl&iacute;cita das partes componentes
	        </h6>
    	</div>
		<div class="panel-body">
		   <p>A cana-de-a&ccedil;&uacute;car tem sido uma cultura tradicional do Brasil, atualmente &eacute; uma das&nbsp;mais importantes pela relev&acirc;ncia na economia e por ter a terceira posi&ccedil;&atilde;o em superf&iacute;cie&nbsp;ocupada no territ&oacute;rio nacional, essa cultura tamb&eacute;m pode ser entendida como um sistema&nbsp;de produ&ccedil;&atilde;o agr&iacute;cola pelos diversos fatores e fen&ocirc;menos que integra, envolvendo fatores&nbsp;ambientais, sociais e econ&ocirc;micos, o que dificulta a compreens&atilde;o e conserva&ccedil;&atilde;o a longo<br />
		prazo deles, para diminuir a incerteza &eacute; necess&aacute;rio ter uma base conceitual dos aspectos&nbsp;cr&iacute;ticos para tomar decis&otilde;es que garantam a sustentabilidade desses tipos de sistemas&nbsp;produtivos.</p>

		<p><br />
		O problema que &eacute; abordado na presente pesquisa &eacute; como desenvolver um sistema de apoio&nbsp;&agrave; decis&atilde;o, por meio das tecnologias da web sem&acirc;ntica, para manter uma base conceitual&nbsp;adapt&aacute;vel as mudan&ccedil;as do dom&iacute;nio, que d&ecirc; suporte ao armazenamento e &agrave; recupera&ccedil;&atilde;o&nbsp;de informa&ccedil;&atilde;o e que permita uma interface gr&aacute;fica flexivel aos conceitos envolvidos, para&nbsp;realizar o processo de avalia&ccedil;&atilde;o da sustentabilidade dos sistemas produtivos de cana-de-<br />
		a&ccedil;&uacute;car no centro-sul do Brasil.</p>

		<p><br />
		Para sistematizar o processo de avalia&ccedil;&atilde;o da sustentabilidade &eacute; necess&aacute;rio representar&nbsp;o dom&iacute;nio de conhecimento por meio da defini&ccedil;&atilde;o de uma ontologia que represente os&nbsp;conceitos dos especialistas e a metodologia de avalia&ccedil;&atilde;o da sustentabilidade desenvolvida&nbsp;pela Embrapa Meio Ambiente, constituindo assim a base conceitual do sistema web&nbsp;SustenAgro que integrar&aacute; tecnologias da web sem&acirc;ntica como ontologias, armazenamento<br />
		em triplestore, consultas sem&acirc;nticas e as Domain Specific Language (DSL) , satisfazendo&nbsp;v&aacute;rios requisitos de Flexibility e Usability do Sistema Web.</p>

<p><br />
Al&eacute;m dessa ontologia ser&aacute; desenvolvida uma ontologia que represente a interface gr&aacute;fica,&nbsp;a qual ser&aacute; usada por uma DSL que permitir&aacute; definir interfaces gr&aacute;ficas baseadas nos&nbsp;conceitos do dom&iacute;nio, permitindo desta maneira o desenvolvimento de sistemas de apoio&nbsp;a decis&atilde;o flex&iacute;veis ao dom&iacute;nio do conhecimento.</p>

<p><br />
Os principais aportes do projeto s&atilde;o: as duas ontologias para representa&ccedil;&atilde;o do dom&iacute;nio&nbsp;e as DSL que t&ecirc;m a finalidade de facilitar a modifica&ccedil;&atilde;o dos conceitos do dom&iacute;nio e da&nbsp;interface gr&aacute;fica por parte dos especialistas, fornecendo desta maneira a flexibilidade do&nbsp;sistema na adapta&ccedil;&atilde;o &agrave;s mudan&ccedil;as.</p>

<p><br />
<strong>Palabras chave:</strong> Sistema web, Sistemas de apoio a decis&atilde;o, Metodologia de avalia&ccedil;&atilde;o&nbsp;da sustentabilidade, Sistema agr&iacute;cola, Sistemas produtivos de cana-de-a&ccedil;&uacute;car.</p>

		</div>
	</div>

	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	Arquitetura do sistema
	        </h6>
    	</div>
		<div class="panel-body">
		    <div>
	        <img src="/images/arquitectura.png" alt="logo" class="img-centered" />
	        </div>

	        <p><strong>Triplestore:&nbsp;</strong></p>

			<p>Sistema de armazenamento e recupera&ccedil;&atilde;o de dados e informa&ccedil;&otilde;es que permitir&aacute; padroniza-las em formato de triplas, permitindo a compatibilidade e o reuso das informa&ccedil;&otilde;es entre fontes de dados externas.</p>

			<p>Para o presente projeto foi selecionada a Triplestore Parliament</p>

			<p><strong>Ontologia de dom&iacute;nio:</strong></p>

			<p>Estes elementos v&atilde;o permitir avaliar a sustentabilidade de uma unidade produtiva e gerar um resultado que permitira fazer compara&ccedil;&otilde;es e indicar recomenda&ccedil;&otilde;es para garantir a sustentabilidade, est&aacute; ontologia contem os seguintes elementos fundamentais:</p>

			<ul>
				<li>As dimens&otilde;es de sustentabilidade</li>
				<li>Os indicadores de sustentabilidade</li>
				<li>Os componentes de indicadores</li>
				<li>Os limiares dos indicadores</li>
				<li>A metodologia de avalia&ccedil;&atilde;o</li>
				<li>Os &iacute;ndices de sustentabilidade</li>
			</ul>

			<p><strong>Ontologia de interface gr&aacute;fica:</strong></p>

			<p>Essa ontologia da web sem&acirc;ntica vai representar:&nbsp;</p>

			<ul>
				<li>Os controles visuais</li>
				<li>Os tipos de controles visuais</li>
				<li>Os tipos de dados suportados</li>
				<li>O padr&atilde;o de entrada de dados</li>
				<li>O padr&atilde;o de sa&iacute;da de dados sa&iacute;da</li>
			</ul>

			<p><strong>Domain Specific Language (DSL)</strong></p>

			<p>Uma linguagem especifica de dom&iacute;nio que permitira fazer:&nbsp;</p>

			<ul>
				<li>A deﬁni&ccedil;&atilde;o dos indicadores</li>
				<li>A defini&ccedil;&atilde;o de interfaces de usu&aacute;rio</li>
				<li>O sistema gerador de interfaces</li>
			</ul>

			<p><strong>Sistema gerador de interfaces gr&aacute;ficas</strong></p>

			<p>O sistema gerador de interfaces &eacute; uma camada adicional ao processo de deﬁni&ccedil;&atilde;o da interface gr&aacute;ﬁca. Ele usa a DSL de Interface e a as ontologias (de dom&iacute;nio e da UI), Figura 5, para gerar a interface Web no padr&atilde;o HTML.</p>
		</div>
	</div>

	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	Metodologia de Avalia&ccedil;&atilde;o
	        </h6>
    	</div>
		<div class="panel-body">
		    <p>A avalia&ccedil;&atilde;o do sistema ser&aacute; feita por meio de casos de uso para os dois tipos de usu&aacute;rios do sistemas, os usu&aacute;rios administradores e os usu&aacute;rios finais.</p>
		</div>
	</div>

	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	Equipe
	        </h6>
    	</div>
		<div class="panel-body">
		    <p>Projeto liderado pela Embrapa Meio Ambiente desde o 2013 e tem a participa&ccedil;&atilde;o de especialistas nas &aacute;reas de:</p>
		    <ul>
		    	<li>Sustentabilidade</li>
		    	<li>Modelagem de conhecimento</li>
		    	<li>Banco de dados</li>
		    </ul>
		    <p>No ICMC o sistema SustenAgro est&aacute; sendo desenvolvido por:</p>
		    <ul>
		    	<li>Especialista em web sem&acirc;ntica</li>
		    	<li>Mestrando focado na arquitetura do software e no sistema de armazenamento e recupera&ccedil;&atilde;o de dados (back-end)</li>
		    	<li>Mestrado focado na interface gr&aacute;fica e intera&ccedil;&atilde;o com os usu&aacute;rios (front-end)</li>
		    </ul>
		</div>
	</div>	

	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	Dura&ccedil;&atilde;o da Pesquisa
	        </h6>
    	</div>
		<div class="panel-body">
		    1 (um) ano
		</div>
	</div>

	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	Publica&ccedil;&otilde;es, Slides ou P&ocirc;steres, Demos/Pilotos
	        </h6>
    	</div>
		<div class="panel-body">
			<ul>
			<li><a href="/documents/qualificacao.pdf" target="_blank">Documento da qualifica&ccedil;&atilde;o</a>
			</li>
			<li><a href="/documents/slides.pptx" target="_blank">Slides da qualifica&ccedil;&atilde;o</a>
			</li>
		</ul>

					    
		</div>
	</div>

	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	Limitaç&ccedil;&otilde;es
	        </h6>
    	</div>
		<div class="panel-body">
		    
		</div>
	</div>

	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	Contribui&ccedil;&otilde;es
	        </h6>
    	</div>
		<div class="panel-body">
		    
		</div>
	</div>

	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	Monografia de Qualifica&ccedil;&atilde;o, Disserta&ccedil;&atilde;o/Tese
	        </h6>
    	</div>
		<div class="panel-body">
		    
		</div>
	</div>

	<div class="panel panel-default">
		<div class="panel-heading">
	        <h6 class="panel-title">
	        	Dados/Recursos ou Benchmarks criados, Links Interessantes
	        </h6>
    	</div>
		<div class="panel-body">
		    
		</div>
	</div>	
</div>

  	  </div>
      <footer class="site-footer">
<div class="row footer">
  <div class="col-sm-12">
    <h6><a href="/">By <b>John Garavito</b></a></h6>
  </div>
</div>
</footer>

    </div>
  </body>
</html>
